tap "r-lib/rig"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Vector graphics library with cross-device output support
brew "cairo"
# Emacs dependency management
brew "cask"
# Load/unload environment variables based on $PWD
brew "direnv"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# CLI for Drive, Gmail, Calendar, Sheets, Docs, Chat, Admin, and more
brew "googleworkspace-cli"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern and intuitive terminal-based text editor
brew "micro"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Rust toolchain installer
brew "rustup"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Programmatically correct mistyped console commands
brew "thefuck"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Desktop password and login vault
cask "bitwarden"
# Terminal-based AI coding assistant
cask "claude-code@latest"
# AI code review CLI
cask "coderabbit"
# Scientific and technical publishing system
cask "quarto"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Open-source code editor
cask "visual-studio-code"
vscode "anthropic.claude-code"
vscode "github.copilot-chat"
vscode "ms-vscode-remote.remote-ssh"
go "mvdan.cc/sh/v3/cmd/shfmt"
uv "shandy-sqlfmt"
